# PanelMismatchCircuitType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElectricalFailures..::..PanelMismatchCircuitType Property
BuiltInFailures..::..ElectricalFailures Class See Also
---
Cannot assign [Element] to Circuit. The Type for the panel does not match the Type ([Name]) for the Circuit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId PanelMismatchCircuitType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PanelMismatchCircuitType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ PanelMismatchCircuitType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElectricalFailures Class
Autodesk.Revit.DB Namespace